{
  "errors": {
    "2fa": {
      "backup_code_error": "Une erreur est survenue lors de la vérification de votre code de sauvegarde.",
      "code_expired": "Le code envoyé par email a expiré.",
      "invalid_backup_code": "Le code de sauvegarde est incorrect.",
      "invalid_code": "Le code est incorrect.",
      "invalid_method": "La méthode fournie est invalide.",
      "setup_required": "Veuillez réessayer de configurer la méthode de double authentification.",
      "update_preferred_method_error": "Votre préférence n'a pas pu être appliquée."
    },
    "app": {
      "already_enabled": "La double authentification par application est déjà activée.",
      "configuration_error": "Une erreur est survenue lors de la configuration de l'application d'authentification.",
      "disable_error": "Une erreur est survenue lors de la désactivation de l'application d'authentification.",
      "enable_error": "Une erreur est survenue lors de l'activation de l'application d'authentification.",
      "not_enabled": "La double authentification par application n'est pas activée."
    },
    "email": {
      "already_enabled": "La double authentification par email est déjà activée.",
      "configuration_error": "La configuration de la double authentification par email a échouée. Veuillez réessayer plus tard.",
      "disable_error": "Une erreur est survenue lors de la désactivation de la double authentification par mail.",
      "not_enabled": "La double authentification par email n'est pas activée.",
      "resend_error": "Le renvoi d'un nouveau code par email a échoué."
    },
    "email_already_verified": "Votre adresse mail est déjà vérifée.",
    "email_exists": "Cet email est déjà utilisé.",
    "email_not_verified": "Votre adresse mail n'est pas vérifiée.",
    "getstatus_error": "Une erreur est survenue lors de la récupération du statut de la double authentification.",
    "invalid_credentials": "Email ou mot de passe incorrect.",
    "invalid_email": "Le format de l'adresse mail n'est pas valide",
    "invalid_name": "Le nom et le prénom doivent être compris entre 3 et 30 caractères.",
    "invalid_password": "Le mot de passe ne rempli pas tous les critères.",
    "invalid_token": "Le lien est invalide ou expiré.",
    "missing_credentials": "Email et mot de passe sont requis.",
    "missing_fields": "Tous les champs sont obligatoires.",
    "not_enabled": "La double authentification n'est pas activée.",
    "password_incorrect": "Le mot de passe est incorrect.",
    "session_expired": "La session a expirée.",
    "token_expired": "Le lien est expiré.",
    "unauthorized": "Vous n'êtes pas autorisé à accéder à cette ressource.",
    "user_not_found": "Utilisateur introuvable.",
    "webauthn": {
      "authentication": "La vérification de votre clé d'accès a échouée. Veuillez réessayer plus tard.",
      "challenge_expired": "Votre clé d'accès n'est pas authentique. Veuillez réessayer.",
      "credential_not_found": "Votre clé d'accès ne correspond à aucune clé enregistrée.",
      "credential_removal": "La suppression de votre clé d'accès a échouée. Veuillez réessayer plus tard.",
      "not_enabled": "L'authentification par clé d'accès n'est pas activée pour votre compte ou aucune clé d'accès n'a été enregistrée.",
      "registration_error": "L'enregistrement de la clé d'accès a échoué. Veuillez réessayer plus tard.",
      "registration_failed": "Votre clé d'accès n'a pas pu être enregistrée pour des raisons de sécurité. Veuillez réessayer plus tard.",
      "registration_options_error": "Erreur lors de la création de la clé d'accès"
    }
  },
  "success": {
    "2fa": {
      "backup_code_used": "Votre code de sauvegarde a été utilisé pour vous connecter. Vous ne pourrez plus l'utiliser."
    },
    "app": {
      "disabled": "La double authentification par application est désactivée.",
      "enabled": "La double authentification par application est activée.",
      "setup_initiated": "La double authentification par application est configurée. Veuillez suivre les indications pour valider l'opération."
    },
    "email": {
      "code_resend": "Un nouveau code a été envoyé par email.",
      "disabled": "La double authentification par email est désactivée.",
      "enabled": "La double authentification par email est activée.",
      "setup_initiated": "La double authentification par email est configurée. Veuillez suivre les indications pour valider l'opération."
    },
    "email_verified": "Votre adresse est maintenant vérifée",
    "logged_in": "Connexion réussie",
    "logged_out": "Déconnexion réussie",
    "password_changed": "Votre mot de passe a été modifé.",
    "password_reset": "Votre mot de passe a été réinitialisé",
    "registered": "Votre compte a été créé !",
    "registration_options_generated": "Clé d'accès générée. Veuillez suivre les instructions pour confirmer l'opération.",
    "reset_email_sent": "L'email de réinitialisation de mot de passe a été envoyé à l'adresse fournie.",
    "webauthn": {
      "credential_removed": "Votre clé d'accès a été supprimée.",
      "registration_response_successful": "Votre clé d'accès a été enregistrée."
    }
  },
  "unkown_loc": "Localisation inconnue"
}
